generation.xml

<x:Envelope
    xmlns:x="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ws="http://ws.online.asp.core.paperless.cl">
    <x:Header/>
    <x:Body>
        <ws:OnlineGeneration>
            <ws:ruc>@@ruc@@</ws:ruc>
            <ws:login>@@login@@</ws:login>
            <ws:clave>@@clave@@</ws:clave>
            <ws:docTxt>
<![CDATA[@@data@@
PE|Plantilla|T01_ch.jasper]]>
          </ws:docTxt>
            <ws:tipoFoliacion>1</ws:tipoFoliacion>
            <ws:tipoRetorno>4</ws:tipoRetorno>
        </ws:OnlineGeneration>
    </x:Body>
</x:Envelope>